input/pagecontent/HIE.md
```mermaid
classDiagram

class DocumentReference

namespace Unstructured {
    class BinaryPDF
}

namespace Structured {
    class Composition
    class DiagnosticReport
    class Patient
    class ServiceRequest
    class Specimen
    class BinaryPDF2["BinaryPDF"]
    class Observation
}

DocumentReference --> BinaryPDF
DocumentReference --> Composition

Composition o-- Patient
Composition o-- DiagnosticReport
Composition o-- ServiceRequest
Composition o-- Specimen
Composition o-- BinaryPDF2
Composition o-- Observation
DiagnosticReport o-- Observation
```
